FreeRTOS/iot-reference-esp32/main/src/ota_pal.c
/*
 * Copyright 2018 Espressif Systems (Shanghai) PTE LTD
 *
 * FreeRTOS OTA PAL for ESP32-DevKitC ESP-WROVER-KIT V1.0.4
 * Copyright (C) 2020 Amazon.com, Inc. or its affiliates.  All Rights Reserved.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *  http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.*/

/* OTA PAL implementation for Espressif esp32_devkitc_esp_wrover_kit platform */

#include <stdint.h>
#include <stdio.h>
#include <string.h>
#include <sys/param.h>

#include "ota_config.h"

#include "ota_config.h"
#include "ota_pal.h"

#include "core_pkcs11.h"
#include "esp_log.h"
#include "esp_partition.h"
#include "esp_system.h"
#include "hal/wdt_hal.h"
#include "iot_crypto.h"

#if !CONFIG_IDF_TARGET_ESP32C6 && !CONFIG_IDF_TARGET_ESP32H2
#include "soc/rtc_cntl_reg.h"
#else
#include "soc/lp_analog_peri_reg.h"
#include "soc/lp_timer_reg.h"
#include "soc/lp_wdt_reg.h"
#include "soc/pmu_reg.h"
#endif

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
#include "spi_flash_mmap.h"
#else
#include "esp_spi_flash.h"
#endif
#include "aws_esp_ota_ops.h"
#include "esp_image_format.h"
#include "esp_ota_ops.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "mbedtls/asn1.h"
#include "mbedtls/base64.h"
#include "mbedtls/bignum.h"
#include "mbedtls/md.h" // Add this at the top with other includes
#include "mbedtls/pk.h"

static mbedtls_pk_context codeSigningKey; // Declare static key context globally

#define OTA_HALF_SECOND_DELAY pdMS_TO_TICKS(500UL)
#define ECDSA_INTEGER_LEN 32

static const char *TAG = "MY_OTA_PAL";

/* Check configuration for memory constraints provided SPIRAM is not enabled */
#if !CONFIG_SPIRAM_SUPPORT
#if (configENABLED_DATA_PROTOCOLS & OTA_DATA_OVER_HTTP) && (configENABLED_NETWORKS & AWSIOT_NETWORK_TYPE_BLE)
#error "Cannot enable OTA data over HTTP together with BLE because of not enough heap."
#endif
#endif /* !CONFIG_SPIRAM_SUPPORT */

/*
 * Includes 4 bytes of version field, followed by 64 bytes of signature
 * (Rest 12 bytes for padding to make it 16 byte aligned for flash encryption)
 */
#define ECDSA_SIG_SIZE 80

typedef struct {
    const esp_partition_t *update_partition;
    const AfrOtaJobDocumentFields_t *cur_ota;
    esp_ota_handle_t update_handle;
    uint32_t data_write_len;
    bool valid_image;
} esp_ota_context_t;

typedef struct {
    uint8_t sec_ver[4];
    uint8_t raw_ecdsa_sig[64];
    uint8_t pad[12];
} esp_sec_boot_sig_t;

static esp_ota_context_t ota_ctx;

static char *codeSigningCertificatePEM = NULL;

/* Specify the OTA signature algorithm we support on this platform. */
const char OTA_JsonFileSignatureKey[OTA_FILE_SIG_KEY_STR_MAX_LENGTH] = "sig-sha256-ecdsa";

static CK_RV prvGetCertificateHandle(CK_FUNCTION_LIST_PTR pxFunctionList, CK_SESSION_HANDLE xSession,
                                     const char *pcLabelName, CK_OBJECT_HANDLE_PTR pxCertHandle);
static CK_RV prvGetCertificate(const char *pcLabelName, uint8_t **ppucData, uint32_t *pulDataSize);

static OtaPalStatus_t asn1_to_raw_ecdsa(const uint8_t *signature, uint16_t sig_len, uint8_t *out_signature) {
    int ret = 0;
    const unsigned char *end = signature + sig_len;
    size_t len;
    mbedtls_mpi r = {0};
    mbedtls_mpi s = {0};

    if (out_signature == NULL) {
        LogError(("ASN1 invalid argument !"));
        goto cleanup;
    }

    mbedtls_mpi_init(&r);
    mbedtls_mpi_init(&s);

    if ((ret = mbedtls_asn1_get_tag(&signature, end, &len, MBEDTLS_ASN1_CONSTRUCTED | MBEDTLS_ASN1_SEQUENCE)) != 0) {
        LogError(("Bad Input Signature"));
        goto cleanup;
    }

    if (signature + len != end) {
        LogError(("Incorrect ASN1 Signature Length"));
        goto cleanup;
    }

    if (((ret = mbedtls_asn1_get_mpi(&signature, end, &r)) != 0) ||
        ((ret = mbedtls_asn1_get_mpi(&signature, end, &s)) != 0)) {
        LogError(("ASN1 parsing failed"));
        goto cleanup;
    }

    ret = mbedtls_mpi_write_binary(&r, out_signature, ECDSA_INTEGER_LEN);
    ret = mbedtls_mpi_write_binary(&s, out_signature + ECDSA_INTEGER_LEN, ECDSA_INTEGER_LEN);

cleanup:
    mbedtls_mpi_free(&r);
    mbedtls_mpi_free(&s);

    if (ret == 0) {
        return OtaPalSuccess;
    } else {
        return OtaPalBadSignerCert;
    }
}

static void _esp_ota_ctx_clear(esp_ota_context_t *ota_ctx) {
    if (ota_ctx != NULL) {
        memset(ota_ctx, 0, sizeof(esp_ota_context_t));
    }
}

static bool _esp_ota_ctx_validate(AfrOtaJobDocumentFields_t *pFileContext) {
    return (pFileContext != NULL && ota_ctx.cur_ota == pFileContext);
}

static void _esp_ota_ctx_close(AfrOtaJobDocumentFields_t *pFileContext) {
    if (pFileContext != NULL) {
        pFileContext->fileId = 0;
    }

    /*memset(&ota_ctx, 0, sizeof(esp_ota_context_t)); */
    ota_ctx.cur_ota = 0;
}

/* Abort receiving the specified OTA update by closing the file. */
OtaPalStatus_t otaPal_Abort(AfrOtaJobDocumentFields_t *const pFileContext) {
    OtaPalStatus_t ota_ret = OtaPalAbortFailed;

    if (_esp_ota_ctx_validate(pFileContext)) {
        _esp_ota_ctx_close(pFileContext);
        ota_ret = OtaPalSuccess;
    } else if (pFileContext && (pFileContext->fileId == 0)) {
        ota_ret = OtaPalSuccess;
    }

    return ota_ret;
}

/* Attempt to create a new receive file for the file chunks as they come in. */
OtaPalStatus_t otaPal_CreateFileForRx(AfrOtaJobDocumentFields_t *const pFileContext) {
    if ((NULL == pFileContext) || (NULL == pFileContext->filepath)) {
        return OtaPalRxFileCreateFailed;
    }

    if (otaPal_SetPlatformImageState(pFileContext, OtaImageStateAccepted) == OtaPalSuccess) {
        /* This demo just accepts the image. But if the application wants to
         * verify any more details about it can be done here. Once verified,
         * the success message can be sent to IoT core. */
        return OtaPalNewImageBooted;
    }

    const esp_partition_t *update_partition = esp_ota_get_next_update_partition(NULL);

    if (update_partition == NULL) {
        LogError(("Failed to find update partition"));
        return OtaPalRxFileCreateFailed;
    }

