FreeRTOS/iot-reference-esp32/main/src/ota_pal.c
    LogInfo(("Writing to partition subtype %d at offset 0x%" PRIx32 "", update_partition->subtype,
             update_partition->address));

    esp_ota_handle_t update_handle;
    esp_err_t err = esp_ota_begin(update_partition, OTA_SIZE_UNKNOWN, &update_handle);

    if (err != ESP_OK) {
        LogError(("esp_ota_begin failed (%d)", err));
        return OtaPalRxFileCreateFailed;
    }

    ota_ctx.cur_ota = pFileContext;
    ota_ctx.update_partition = update_partition;
    ota_ctx.update_handle = update_handle;

    ota_ctx.data_write_len = 0;
    ota_ctx.valid_image = false;

    LogInfo(("esp_ota_begin succeeded"));

    return OtaPalSuccess;
}

static CK_RV prvGetCertificateHandle(CK_FUNCTION_LIST_PTR pxFunctionList, CK_SESSION_HANDLE xSession,
                                     const char *pcLabelName, CK_OBJECT_HANDLE_PTR pxCertHandle) {
    CK_ATTRIBUTE xTemplate;
    CK_RV xResult = CKR_OK;
    CK_ULONG ulCount = 0;
    CK_BBOOL xFindInit = CK_FALSE;

    /* Get the certificate handle. */
    if (0 == xResult) {
        xTemplate.type = CKA_LABEL;
        xTemplate.ulValueLen = strlen(pcLabelName) + 1;
        xTemplate.pValue = (char *)pcLabelName;
        xResult = pxFunctionList->C_FindObjectsInit(xSession, &xTemplate, 1);
    }

    if (0 == xResult) {
        xFindInit = CK_TRUE;
        xResult = pxFunctionList->C_FindObjects(xSession, (CK_OBJECT_HANDLE_PTR)pxCertHandle, 1, &ulCount);
    }

    if (CK_TRUE == xFindInit) {
        xResult = pxFunctionList->C_FindObjectsFinal(xSession);
    }

    return xResult;
}

/* Note that this function mallocs a buffer for the certificate to reside in,
 * and it is the responsibility of the caller to free the buffer. */
static CK_RV prvGetCertificate(const char *pcLabelName, uint8_t **ppucData, uint32_t *pulDataSize) {
    /* Find the certificate */
    CK_OBJECT_HANDLE xHandle = 0;
    CK_RV xResult;
    CK_FUNCTION_LIST_PTR xFunctionList;
    CK_SLOT_ID xSlotId;
    CK_ULONG xCount = 1;
    CK_SESSION_HANDLE xSession;
    CK_ATTRIBUTE xTemplate = {0};
    uint8_t *pucCert = NULL;
    CK_BBOOL xSessionOpen = CK_FALSE;

    xResult = C_GetFunctionList(&xFunctionList);

    if (CKR_OK == xResult) {
        xResult = xFunctionList->C_Initialize(NULL);
    }

    if ((CKR_OK == xResult) || (CKR_CRYPTOKI_ALREADY_INITIALIZED == xResult)) {
        xResult = xFunctionList->C_GetSlotList(CK_TRUE, &xSlotId, &xCount);
    }

    if (CKR_OK == xResult) {
        xResult = xFunctionList->C_OpenSession(xSlotId, CKF_SERIAL_SESSION, NULL, NULL, &xSession);
    }

    if (CKR_OK == xResult) {
        xSessionOpen = CK_TRUE;
        xResult = prvGetCertificateHandle(xFunctionList, xSession, pcLabelName, &xHandle);
    }

    if ((xHandle != 0) && (xResult == CKR_OK)) /* 0 is an invalid handle */
    {
        /* Get the length of the certificate */
        xTemplate.type = CKA_VALUE;
        xTemplate.pValue = NULL;
        xResult = xFunctionList->C_GetAttributeValue(xSession, xHandle, &xTemplate, xCount);

        if (xResult == CKR_OK) {
            pucCert = pvPortMalloc(xTemplate.ulValueLen);
        }

        if ((xResult == CKR_OK) && (pucCert == NULL)) {
            xResult = CKR_HOST_MEMORY;
        }

        if (xResult == CKR_OK) {
            xTemplate.pValue = pucCert;
            xResult = xFunctionList->C_GetAttributeValue(xSession, xHandle, &xTemplate, xCount);

            if (xResult == CKR_OK) {
                *ppucData = pucCert;
                *pulDataSize = xTemplate.ulValueLen;
            } else {
                vPortFree(pucCert);
            }
        }
    } else /* Certificate was not found. */
    {
        *ppucData = NULL;
        *pulDataSize = 0;
    }

    if (xSessionOpen == CK_TRUE) {
        (void)xFunctionList->C_CloseSession(xSession);
    }

    return xResult;
}

uint8_t *otaPal_ReadAndAssumeCertificate(const uint8_t *const pucCertName, uint32_t *const ulSignerCertSize) {
    uint8_t *pucCertData;
    uint32_t ulCertSize;
    uint8_t *pucSignerCert = NULL;
    CK_RV xResult;

    xResult = prvGetCertificate((const char *)pucCertName, &pucSignerCert, ulSignerCertSize);

    if ((xResult == CKR_OK) && (pucSignerCert != NULL)) {
        LogInfo(("Using cert with label: %s OK", (const char *)pucCertName));
    } else {
        LogInfo(("No such certificate file: %s. Using certificate in ota_config.h.", (const char *)pucCertName));

        if (codeSigningCertificatePEM == NULL) {
            LogError(("Certificate not set"));
            return NULL;
        }
        /* Allocate memory for the signer certificate plus a terminating zero so we can copy it and return to the
         * caller. */
        ulCertSize = strlen(codeSigningCertificatePEM) + 1;
        pucSignerCert = pvPortMalloc(ulCertSize);           /*lint !e9029 !e9079 !e838 malloc proto requires void*. */
        pucCertData = (uint8_t *)codeSigningCertificatePEM; /*lint !e9005 we don't modify the cert but it could be set
                                                               by PKCS11 so it's not const. */

        if (pucSignerCert != NULL) {
            memcpy(pucSignerCert, pucCertData, ulCertSize);
            *ulSignerCertSize = ulCertSize;
        } else {
            LogError(("No memory for certificate in otaPal_ReadAndAssumeCertificate!"));
        }
    }

    return pucSignerCert;
}

/* Verify the signature of the specified file. */

OtaPalStatus_t otaPal_CheckFileSignature(AfrOtaJobDocumentFields_t *const pFileContext) {
    OtaPalStatus_t result = OtaPalSignatureCheckFailed;
    mbedtls_md_context_t md_ctx;
    unsigned char hash[32]; // SHA-256 hash size
    static spi_flash_mmap_handle_t ota_data_map;
    uint32_t mmu_free_pages_count, len, flash_offset = 0;
    int ret;

    // Initialize hash context
    mbedtls_md_init(&md_ctx);
    ret = mbedtls_md_setup(&md_ctx, mbedtls_md_info_from_type(MBEDTLS_MD_SHA256), 0);
    if (ret != 0) {
        ESP_LOGE(TAG, "Failed to setup hash context: %d", ret);
        goto cleanup;
    }
    ret = mbedtls_md_starts(&md_ctx);
    if (ret != 0) {
        ESP_LOGE(TAG, "Failed to start hash: %d", ret);
        goto cleanup;
    }

