FreeRTOS/iot-reference-esp32/main/src/ota_pal.c
    // Map and hash the firmware incrementally
    mmu_free_pages_count = spi_flash_mmap_get_free_pages(SPI_FLASH_MMAP_DATA);
    len = ota_ctx.data_write_len;

    while (len > 0) {
        uint32_t mmu_page_offset = ((flash_offset & 0x0000FFFF) != 0) ? 1 : 0;
        uint32_t partial_image_len = MIN(len, ((mmu_free_pages_count - mmu_page_offset) * SPI_FLASH_MMU_PAGE_SIZE));
        const void *buf = NULL;

        esp_err_t map_ret = esp_partition_mmap(ota_ctx.update_partition, flash_offset, partial_image_len,
                                               SPI_FLASH_MMAP_DATA, &buf, &ota_data_map);
        if (map_ret != ESP_OK) {
            ESP_LOGE(TAG, "Partition mmap failed %d", map_ret);
            goto cleanup;
        }

        // Update hash with current chunk
        ret = mbedtls_md_update(&md_ctx, buf, partial_image_len);
        if (ret != 0) {
            ESP_LOGE(TAG, "Failed to update hash: %d", ret);
            spi_flash_munmap(ota_data_map);
            goto cleanup;
        }

        spi_flash_munmap(ota_data_map);
        flash_offset += partial_image_len;
        len -= partial_image_len;
    }

    // Finalize the hash
    ret = mbedtls_md_finish(&md_ctx, hash);
    if (ret != 0) {
        ESP_LOGE(TAG, "Failed to finish hash: %d", ret);
        goto cleanup;
    }

    ESP_LOG_BUFFER_HEX("OTA_SIG", pFileContext->signature,
                       pFileContext->signatureLen > 8 ? 8 : pFileContext->signatureLen);

    // Verify the signature using the public key
    ret = mbedtls_pk_verify(&codeSigningKey, MBEDTLS_MD_SHA256, hash, sizeof(hash),
                            (const unsigned char *)pFileContext->signature, pFileContext->signatureLen);
    if (ret == 0) {
        ESP_LOGI(TAG, "Signature verification succeeded");
        result = OtaPalSuccess;
    } else {
        ESP_LOGE(TAG, "Signature verification failed: %d", ret);
    }

cleanup:
    mbedtls_md_free(&md_ctx);
    return result;
}

/* Close the specified file. This shall authenticate the file if it is marked as secure. */
OtaPalStatus_t otaPal_CloseFile(AfrOtaJobDocumentFields_t *const pFileContext) {
    OtaPalStatus_t mainErr = OtaPalSuccess;

    if (!_esp_ota_ctx_validate(pFileContext)) {
        return OtaPalFileClose;
    }

    if (pFileContext->signature == NULL) {
        LogError(("Image Signature not found"));
        _esp_ota_ctx_clear(&ota_ctx);
        mainErr = OtaPalSignatureCheckFailed;
    } else if (ota_ctx.data_write_len == 0) {
        LogError(("No data written to partition"));
        mainErr = OtaPalSignatureCheckFailed;
    } else {
        /* Verify the file signature, close the file and return the signature verification result. */
        mainErr = otaPal_CheckFileSignature(pFileContext);

        if (mainErr != OtaPalSuccess) {
            esp_partition_erase_range(ota_ctx.update_partition, 0, ota_ctx.update_partition->size);
        } else {
            /* Write ASN1 decoded signature at the end of firmware image for bootloader to validate during bootup */
            esp_sec_boot_sig_t *sec_boot_sig = (esp_sec_boot_sig_t *)malloc(sizeof(esp_sec_boot_sig_t));

            if (sec_boot_sig != NULL) {
                memset(sec_boot_sig->sec_ver, 0x00, sizeof(sec_boot_sig->sec_ver));
                memset(sec_boot_sig->pad, 0xFF, sizeof(sec_boot_sig->pad));
                mainErr = asn1_to_raw_ecdsa((const uint8_t *)pFileContext->signature, pFileContext->signatureLen,
                                            sec_boot_sig->raw_ecdsa_sig);
                if (mainErr == OtaPalSuccess) {
                    esp_err_t ret = esp_ota_write_with_offset(ota_ctx.update_handle, sec_boot_sig, ECDSA_SIG_SIZE,
                                                              ota_ctx.data_write_len);

                    if (ret != ESP_OK) {
                        return OtaPalFileClose;
                    }

                    ota_ctx.data_write_len += ECDSA_SIG_SIZE;
                }

                free(sec_boot_sig);
                ota_ctx.valid_image = true;
            } else {
                mainErr = OtaPalFileClose;
            }
        }
    }

    return mainErr;
}

OtaPalStatus_t IRAM_ATTR otaPal_ResetDevice(AfrOtaJobDocumentFields_t *const pFileContext) {
    (void)pFileContext;

    /* Short delay for debug log output before reset. */
    vTaskDelay(OTA_HALF_SECOND_DELAY);
    esp_restart();
    return OtaPalSuccess;
}

OtaPalStatus_t otaPal_ActivateNewImage(AfrOtaJobDocumentFields_t *const pFileContext) {
    (void)pFileContext;

    if (ota_ctx.cur_ota != NULL) {
        if (esp_ota_end(ota_ctx.update_handle) != ESP_OK) {
            LogError(("esp_ota_end failed!"));
            esp_partition_erase_range(ota_ctx.update_partition, 0, ota_ctx.update_partition->size);
            otaPal_ResetDevice(pFileContext);
        }

        esp_err_t err = esp_ota_set_boot_partition(ota_ctx.update_partition);

        if (err != ESP_OK) {
            LogError(("esp_ota_set_boot_partition failed (%d)!", err));
            esp_partition_erase_range(ota_ctx.update_partition, 0, ota_ctx.update_partition->size);
            _esp_ota_ctx_clear(&ota_ctx);
        }

        otaPal_ResetDevice(pFileContext);
    }

    _esp_ota_ctx_clear(&ota_ctx);
    otaPal_ResetDevice(pFileContext);
    return OtaPalSuccess;
}

/* Write a block of data to the specified file. */
int16_t otaPal_WriteBlock(AfrOtaJobDocumentFields_t *const pFileContext, uint32_t iOffset, uint8_t *const pacData,
                          uint32_t iBlockSize) {
    if (_esp_ota_ctx_validate(pFileContext)) {
        esp_err_t ret = esp_ota_write_with_offset(ota_ctx.update_handle, pacData, iBlockSize, iOffset);

        if (ret != ESP_OK) {
            LogError(("Couldn't flash at the offset %" PRIu32 "", iOffset));
            return -1;
        }

        ota_ctx.data_write_len += iBlockSize;
    } else {
        LogInfo(("Invalid OTA Context"));
        return -1;
    }

    return iBlockSize;
}

OtaPalImageState_t otaPal_GetPlatformImageState(AfrOtaJobDocumentFields_t *const pFileContext) {
    OtaPalImageState_t eImageState = OtaPalImageStateUnknown;
    uint32_t ota_flags;

    (void)pFileContext;

    LogInfo(("%s", __func__));

    if ((ota_ctx.cur_ota != NULL) && (ota_ctx.data_write_len != 0)) {
        /* Firmware update is complete or on-going, retrieve its status */
        ota_flags = ota_ctx.valid_image == true ? ESP_OTA_IMG_NEW : ESP_OTA_IMG_INVALID;
    } else {
        esp_err_t ret = aws_esp_ota_get_boot_flags(&ota_flags, true);

        if (ret != ESP_OK) {
            LogError(("Failed to get ota flags %d", ret));
            return eImageState;
        }
    }

    switch (ota_flags) {
    case ESP_OTA_IMG_PENDING_VERIFY:
        /* Pending Commit means we're in the Self Test phase. */
        eImageState = OtaPalImageStatePendingCommit;
        break;

    case ESP_OTA_IMG_VALID:
    case ESP_OTA_IMG_NEW:
        eImageState = OtaPalImageStateValid;
        break;

    default:
        eImageState = OtaPalImageStateInvalid;
        break;
    }

    return eImageState;
}

static void disable_rtc_wdt() {
    LogInfo(("Disabling RTC hardware watchdog timer"));

    wdt_hal_context_t rtc_wdt_ctx =
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 1, 0)
        RWDT_HAL_CONTEXT_DEFAULT();
#else
        {.inst = WDT_RWDT, .rwdt_dev = &RTCCNTL};
#endif

    wdt_hal_write_protect_disable(&rtc_wdt_ctx);
    wdt_hal_disable(&rtc_wdt_ctx);
    wdt_hal_write_protect_enable(&rtc_wdt_ctx);
}

OtaPalStatus_t otaPal_SetPlatformImageState(AfrOtaJobDocumentFields_t *const pFileContext, OtaImageState_t eState) {
    OtaPalStatus_t mainErr = OtaPalSuccess;
    int state;

    (void)pFileContext;

    LogInfo(("%s, %d", __func__, eState));

    switch (eState) {
    case OtaImageStateAccepted:
        LogInfo(("Set image as valid one!"));
        state = ESP_OTA_IMG_VALID;
        break;

    case OtaImageStateRejected:
        LogWarn(("Set image as invalid!"));
        state = ESP_OTA_IMG_INVALID;
        break;

    case OtaImageStateAborted:
        LogWarn(("Set image as aborted!"));
        state = ESP_OTA_IMG_ABORTED;
        break;

    case OtaImageStateTesting:
        LogWarn(("Set image as testing!"));
        return OtaPalSuccess;

    default:
        LogWarn(("Set image invalid state!"));
        return OtaPalBadImageState;
    }

    uint32_t ota_flags;
    /* Get current active (running) firmware image flags */
    esp_err_t ret = aws_esp_ota_get_boot_flags(&ota_flags, true);

    if (ret != ESP_OK) {
        LogError(("Failed to get ota flags %d", ret));
        return OtaPalCommitFailed;
    }

    /* If this is first request to set platform state, post bootup and there is not OTA being
     * triggered yet, then operate on active image flags, else use passive image flags */
    if ((ota_ctx.cur_ota == NULL) && (ota_ctx.data_write_len == 0)) {
        if (ota_flags == ESP_OTA_IMG_PENDING_VERIFY) {
            LogInfo(("Image is pending verification."));
            ret = aws_esp_ota_set_boot_flags(state, true);

            if (ret != ESP_OK) {
                LogError(("Failed to set ota flags %d", ret));
                return OtaPalCommitFailed;
            } else {
                /* RTC watchdog timer can now be stopped */
                disable_rtc_wdt();
            }
        } else {
            LogWarn(("Image not in self test mode %" PRIu32 "", ota_flags));
            mainErr = OtaPalCommitFailed; /*ota_flags == ESP_OTA_IMG_VALID ? OtaPalSuccess : OtaPalCommitFailed; */
        }

