FreeRTOS/iot-reference-esp32/main/src/ota_pal.c
        /* For debug purpose only, get current flags */
        aws_esp_ota_get_boot_flags(&ota_flags, true);
    } else {
        if ((eState == OtaImageStateAccepted) && (ota_ctx.valid_image == false)) {
            /* Incorrect update image or not yet validated */
            return OtaPalCommitFailed;
        }

        if (ota_flags != ESP_OTA_IMG_VALID) {
            LogError(("Currently executing firmware not marked as valid, abort"));
            return OtaPalCommitFailed;
        }

        ret = aws_esp_ota_set_boot_flags(state, false);

        if (ret != ESP_OK) {
            LogError(("Failed to set ota flags %d", ret));
            return OtaPalCommitFailed;
        }
    }

    return mainErr;
}

static const esp_partition_t *get_running_firmware(void) {
    const esp_partition_t *configured = esp_ota_get_boot_partition();
    const esp_partition_t *running = esp_ota_get_running_partition();

    ESP_LOGI(TAG, "Running partition type %d subtype %d (offset 0x%08" PRIx32 ")", running->type, running->subtype,
             running->address);
    ESP_LOGI(TAG, "Configured partition type %d subtype %d (offset 0x%08" PRIx32 ")", configured->type,
             configured->subtype, configured->address);
    return running;
}

esp_err_t otaPal_EraseLastBootPartition(void) {
    const esp_partition_t *cur_app = get_running_firmware();

    ESP_LOGI(TAG, "Current running firmware is: %s", cur_app->label);
    return (esp_ota_erase_last_boot_app_partition());
}

bool otaPal_SetCodeSigningCertificate(const char *pcCodeSigningCertificatePEM) {
    int ret;

    // Free any existing key context
    mbedtls_pk_free(&codeSigningKey);
    mbedtls_pk_init(&codeSigningKey);

    // Parse the PEM-formatted public key
    ret = mbedtls_pk_parse_public_key(&codeSigningKey, (const unsigned char *)pcCodeSigningCertificatePEM,
                                      strlen(pcCodeSigningCertificatePEM) + 1);
    if (ret != 0) {
        ESP_LOGE(TAG, "Failed to parse public key: %d", ret);
        return false;
    }

    // Validate that the key is an ECDSA key
    if (mbedtls_pk_get_type(&codeSigningKey) != MBEDTLS_PK_ECKEY) {
        ESP_LOGE(TAG, "Expected an ECDSA public key");
        mbedtls_pk_free(&codeSigningKey);
        return false;
    }

    ESP_LOGI(TAG, "ECDSA public key set successfully");
    return true;
}